In [2]:
import numpy as np
import pandas as pd

In [5]:
pd.__version__

'2.2.3'

### data structures

In [12]:
serie = pd.Series(
    [1, 2, 3, 4],
    name='numbers'
)

In [13]:
serie.dtype

dtype('int64')

In [14]:
serie.size

4

In [17]:
serie.name

'numbers'

In [20]:
serie.values

array([1, 2, 3, 4])

In [25]:
df = pd.DataFrame(
    np.array(
        [
            [1, 2, 3],
            [4, 5, 6]
        ]
    ),
    columns=['one', 'tw', 'th']
)

### Attributes

In [31]:
df

   one  tw  th
0    1   2   3
1    4   5   6

In [27]:
df.shape

(2, 3)

In [28]:
df.columns

Index(['one', 'tw', 'th'], dtype='object')

In [37]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [38]:
df.values

array([[1, 2, 3],
       [4, 5, 6]])

### load & save datasets

In [ ]:
pd.read_csv, pd.read_excel, pd.read_json, pd.read_parquet, 
# pd.read_sql, pd.read_sql_table

In [2]:
df = pd.read_csv('data.csv')

In [57]:
df.head()
# df.tail()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [42]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country'],
      dtype='object')

In [58]:
df.shape
# df.size # numbers of elements

(541909, 8)

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [56]:
df.describe()

            Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

In [64]:
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'])

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [66]:
df.describe()

,Quantity,InvoiceDate,UnitPrice,CustomerID
count,541909.000000,541909,541909.000000,406829.000000
mean,9.552250,2011-07-04 13:34:57.156386048,4.611114,15287.690570
min,-80995.000000,2010-12-01 08:26:00,-11062.060000,12346.000000
25%,1.000000,2011-03-28 11:34:00,1.250000,13953.000000
50%,3.000000,2011-07-19 17:17:00,2.080000,15152.000000
75%,10.000000,2011-10-19 11:27:00,4.130000,16791.000000
max,80995.000000,2011-12-09 12:50:00,38970.000000,18287.000000
std,218.081158,NaN,96.759853,1713.600303

### filtering

In [75]:
df[df['Quantity'] > 5]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541896,581587,22555,PLASTERS IN TIN STRONGMAN,12,2011-12-09 12:50:00,1.65,12680.0,France
541901,581587,22367,CHILDRENS APRON SPACEBOY DESIGN,8,2011-12-09 12:50:00,1.95,12680.0,France
541902,581587,22629,SPACEBOY LUNCH BOX,12,2011-12-09 12:50:00,1.95,12680.0,France
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France

In [74]:
df[df['Quantity'] > df['Quantity'].mean()]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
9,536367,84879,ASSORTED COLOUR BIRD ORNAMENT,32,2010-12-01 08:34:00,1.69,13047.0,United Kingdom
26,536370,22728,ALARM CLOCK BAKELIKE PINK,24,2010-12-01 08:45:00,3.75,12583.0,France
27,536370,22727,ALARM CLOCK BAKELIKE RED,24,2010-12-01 08:45:00,3.75,12583.0,France
28,536370,22726,ALARM CLOCK BAKELIKE GREEN,12,2010-12-01 08:45:00,3.75,12583.0,France
29,536370,21724,PANDA AND BUNNIES STICKER SHEET,12,2010-12-01 08:45:00,0.85,12583.0,France
...,...,...,...,...,...,...,...,...
541894,581587,22631,CIRCUS PARADE LUNCH BOX,12,2011-12-09 12:50:00,1.95,12680.0,France
541895,581587,22556,PLASTERS IN TIN CIRCUS PARADE,12,2011-12-09 12:50:00,1.65,12680.0,France
541896,581587,22555,PLASTERS IN TIN STRONGMAN,12,2011-12-09 12:50:00,1.65,12680.0,France
541902,581587,22629,SPACEBOY LUNCH BOX,12,2011-12-09 12:50:00,1.95,12680.0,France
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France

In [87]:
df.iloc[
    [1, 10], # row
    [2, 4] # column
]

                   Description         InvoiceDate
1          WHITE METAL LANTERN 2010-12-01 08:26:00
10  POPPY'S PLAYHOUSE BEDROOM  2010-12-01 08:34:00

In [85]:
df.iloc[1:10, 0:3]

  InvoiceNo StockCode                          Description
1    536365     71053                  WHITE METAL LANTERN
2    536365    84406B       CREAM CUPID HEARTS COAT HANGER
3    536365    84029G  KNITTED UNION FLAG HOT WATER BOTTLE
4    536365    84029E       RED WOOLLY HOTTIE WHITE HEART.
5    536365     22752         SET 7 BABUSHKA NESTING BOXES
6    536365     21730    GLASS STAR FROSTED T-LIGHT HOLDER
7    536366     22633               HAND WARMER UNION JACK
8    536366     22632            HAND WARMER RED POLKA DOT
9    536367     84879        ASSORTED COLOUR BIRD ORNAMENT

In [82]:
df.loc[
    (df['Quantity'] > df['Quantity'].mean())&
    (df['UnitPrice'] > df['UnitPrice'].mean())
]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
65,536374,21258,VICTORIAN SEWING BOX LARGE,32,2010-12-01 09:09:00,10.95,15100.0,United Kingdom
140,536381,21523,DOORMAT FANCY FONT HOME SWEET HOME,10,2010-12-01 09:41:00,6.75,15311.0,United Kingdom
150,536382,22926,IVORY GIANT GARDEN THERMOMETER,12,2010-12-01 09:45:00,5.95,16098.0,United Kingdom
175,536386,84880,WHITE WIRE EGG HOLDER,36,2010-12-01 09:57:00,4.95,16029.0,United Kingdom
228,536390,22654,DELUXE SEWING KIT,40,2010-12-01 10:19:00,4.95,17511.0,United Kingdom
...,...,...,...,...,...,...,...,...
541500,581498,23382,BOX OF 6 CHRISTMAS CAKE DECORATIONS,10,2011-12-09 10:26:00,7.46,NaN,United Kingdom
541513,581498,79321,CHILLI LIGHTS,10,2011-12-09 10:26:00,12.46,NaN,United Kingdom
541827,581579,23313,VINTAGE CHRISTMAS BUNTING,15,2011-12-09 12:19:00,4.95,17581.0,United Kingdom
541892,581586,21217,RED RETROSPOT ROUND CAKE TINS,24,2011-12-09 12:49:00,8.95,13113.0,United Kingdom
541893,581586,20685,DOORMAT RED RETROSPOT,10,2011-12-09 12:49:00,7.08,13113.0,United Kingdom

In [97]:
df.query("Quantity > 10 and UnitPrice < 5")

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
9,536367,84879,ASSORTED COLOUR BIRD ORNAMENT,32,2010-12-01 08:34:00,1.69,13047.0,United Kingdom
26,536370,22728,ALARM CLOCK BAKELIKE PINK,24,2010-12-01 08:45:00,3.75,12583.0,France
27,536370,22727,ALARM CLOCK BAKELIKE RED,24,2010-12-01 08:45:00,3.75,12583.0,France
28,536370,22726,ALARM CLOCK BAKELIKE GREEN,12,2010-12-01 08:45:00,3.75,12583.0,France
29,536370,21724,PANDA AND BUNNIES STICKER SHEET,12,2010-12-01 08:45:00,0.85,12583.0,France
...,...,...,...,...,...,...,...,...
541894,581587,22631,CIRCUS PARADE LUNCH BOX,12,2011-12-09 12:50:00,1.95,12680.0,France
541895,581587,22556,PLASTERS IN TIN CIRCUS PARADE,12,2011-12-09 12:50:00,1.65,12680.0,France
541896,581587,22555,PLASTERS IN TIN STRONGMAN,12,2011-12-09 12:50:00,1.65,12680.0,France
541902,581587,22629,SPACEBOY LUNCH BOX,12,2011-12-09 12:50:00,1.95,12680.0,France
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France

In [99]:
df.where(df['UnitPrice'] < 10, 0)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

In [11]:
df[np.isnan(df['CustomerID'])]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
622,536414,22139,NaN,56,12/1/2010 11:52,0.00,NaN,United Kingdom
1443,536544,21773,DECORATIVE ROSE BATHROOM BOTTLE,1,12/1/2010 14:32,2.51,NaN,United Kingdom
1444,536544,21774,DECORATIVE CATS BATHROOM BOTTLE,2,12/1/2010 14:32,2.51,NaN,United Kingdom
1445,536544,21786,POLKADOT RAIN HAT,4,12/1/2010 14:32,0.85,NaN,United Kingdom
1446,536544,21787,RAIN PONCHO RETROSPOT,2,12/1/2010 14:32,1.66,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
541536,581498,85099B,JUMBO BAG RED RETROSPOT,5,12/9/2011 10:26,4.13,NaN,United Kingdom
541537,581498,85099C,JUMBO BAG BAROQUE BLACK WHITE,4,12/9/2011 10:26,4.13,NaN,United Kingdom
541538,581498,85150,LADIES & GENTLEMEN METAL SIGN,1,12/9/2011 10:26,4.96,NaN,United Kingdom
541539,581498,85174,S/4 CACTI CANDLES,1,12/9/2011 10:26,10.79,NaN,United Kingdom
541540,581498,DOT,DOTCOM POSTAGE,1,12/9/2011 10:26,1714.17,NaN,United Kingdom

## Agg & stats

In [8]:
df.mean(numeric_only=True)
df.max(numeric_only=True)
df.min(numeric_only=True)
df.median(numeric_only=True)
df.var(numeric_only=True)

Quantity      4.755939e+04
UnitPrice     9.362469e+03
CustomerID    2.936426e+06
dtype: float64

In [9]:
df.count()

InvoiceNo      541909
StockCode      541909
Description    540455
Quantity       541909
InvoiceDate    541909
UnitPrice      541909
CustomerID     406829
Country        541909
dtype: int64

In [17]:
df.nunique()

InvoiceNo      25900
StockCode       4070
Description     4223
Quantity         722
InvoiceDate    23260
UnitPrice       1630
CustomerID      4372
Country           38
dtype: int64

In [18]:
df['Country'].value_counts()

Country
United Kingdom          495478
Germany                   9495
France                    8557
EIRE                      8196
Spain                     2533
Netherlands               2371
Belgium                   2069
Switzerland               2002
Portugal                  1519
Australia                 1259
Norway                    1086
Italy                      803
Channel Islands            758
Finland                    695
Cyprus                     622
Sweden                     462
Unspecified                446
Austria                    401
Denmark                    389
Japan                      358
Poland                     341
Israel                     297
USA                        291
Hong Kong                  288
Singapore                  229
Iceland                    182
Canada                     151
Greece                     146
Malta                      127
United Arab Emirates        68
European Community          61
RSA                         58
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              30
Bahrain                     19
Saudi Arabia                10
Name: count, dtype: int64

In [20]:
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [29]:
df_agg = df.groupby('Country').agg(
    {
        'CustomerID': 'nunique'
    }
).sort_values(by='CustomerID', ascending=False)

In [37]:
df_agg.reset_index()

                 Country  CustomerID
0         United Kingdom        3950
1                Germany          95
2                 France          87
3                  Spain          31
4                Belgium          25
5            Switzerland          21
6               Portugal          19
7                  Italy          15
8                Finland          12
9                Austria          11
10                Norway          10
11       Channel Islands           9
12           Netherlands           9
13             Australia           9
14               Denmark           9
15                Cyprus           8
16                 Japan           8
17                Sweden           8
18                Poland           6
19           Unspecified           4
20                Canada           4
21                   USA           4
22                Greece           4
23                Israel           4
24                  EIRE           3
25               Bahrain           2
26                 Malta           2
27  United Arab Emirates           2
28                Brazil           1
29        Czech Republic           1
30          Saudi Arabia           1
31               Lebanon           1
32               Iceland           1
33    European Community           1
34             Lithuania           1
35                   RSA           1
36             Singapore           1
37             Hong Kong           0

In [32]:
df_agg.columns

Index(['CustomerID'], dtype='object')

In [41]:
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'])

In [42]:
df.describe()

,Quantity,InvoiceDate,UnitPrice,CustomerID
count,541909.000000,541909,541909.000000,406829.000000
mean,9.552250,2011-07-04 13:34:57.156386048,4.611114,15287.690570
min,-80995.000000,2010-12-01 08:26:00,-11062.060000,12346.000000
25%,1.000000,2011-03-28 11:34:00,1.250000,13953.000000
50%,3.000000,2011-07-19 17:17:00,2.080000,15152.000000
75%,10.000000,2011-10-19 11:27:00,4.130000,16791.000000
max,80995.000000,2011-12-09 12:50:00,38970.000000,18287.000000
std,218.081158,NaN,96.759853,1713.600303

In [55]:
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

In [57]:
df = df.assign(
    DateMonth = lambda x: x.InvoiceDate.dt.to_period('M')
)

In [58]:
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,DateMonth
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,2010-12
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010-12
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,2010-12
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010-12
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010-12
...,...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France,2011-12
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France,2011-12
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France,2011-12
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France,2011-12
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France,2011-12

In [54]:
df.groupby(df['InvoiceDate'].dt.to_period('M')).agg(
    {
        'Quantity': 'sum',
        'CustomerID': 'nunique'
    }
).reset_index()

   InvoiceDate  Quantity  CustomerID
0      2010-12    342228         948
1      2011-01    308966         783
2      2011-02    277989         798
3      2011-03    351872        1020
4      2011-04    289098         899
5      2011-05    380391        1079
6      2011-06    341623        1051
7      2011-07    391116         993
8      2011-08    406199         980
9      2011-09    549817        1302
10     2011-10    570532        1425
11     2011-11    740286        1711
12     2011-12    226333         686

In [3]:
datasets = pd.read_csv("https://raw.githubusercontent.com/vincentarelbundock/Rdatasets/master/datasets.csv")

In [5]:
datasets[datasets['Title'].str.contains('sale')]

,Package,Item,Title,Rows,Cols,n_binary,n_character,n_factor,n_logical,n_numeric,CSV,Doc
261,causaldata,avocado,Data on avocado sales,169,3,0,0,0,0,2,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
904,forecast,wineind,Australian total wine sales,176,2,0,0,0,0,2,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
919,fpp2,elecsales,Electricity sales to residential customers in ...,20,2,0,0,0,0,2,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
954,fpp3,aus_vehicle_sales,Australian vehicle sales,864,3,0,1,0,0,1,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
1017,generalCorr,sales2Lag,internal sales2Lag,1176,1,0,0,0,0,1,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
1018,generalCorr,salesLag,internal salesLag,1176,1,0,0,0,0,1,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
1033,ggplot2,txhousing,Housing sales in TX,8602,9,0,1,0,0,8,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
1046,gt,pizzaplace,A year of pizza sales from a pizza place,49574,7,0,6,0,0,1,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
1397,modeldata,car_prices,Kelly Blue Book resale data for 2005 model yea...,804,18,15,0,0,0,18,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...

In [4]:
main_df = pd.read_csv(datasets.iloc[1046]["CSV"])

In [6]:
main_df

,rownames,id,date,time,name,size,type,price
0,1,2015-000001,2015-01-01,11:38:36,hawaiian,M,classic,13.25
1,2,2015-000002,2015-01-01,11:57:40,classic_dlx,M,classic,16.00
2,3,2015-000002,2015-01-01,11:57:40,mexicana,M,veggie,16.00
3,4,2015-000002,2015-01-01,11:57:40,thai_ckn,L,chicken,20.75
4,5,2015-000002,2015-01-01,11:57:40,five_cheese,L,veggie,18.50
...,...,...,...,...,...,...,...,...
49569,49570,2015-021348,2015-12-31,21:23:10,four_cheese,L,veggie,17.95
49570,49571,2015-021348,2015-12-31,21:23:10,napolitana,S,classic,12.00
49571,49572,2015-021348,2015-12-31,21:23:10,ckn_alfredo,M,chicken,16.75
49572,49573,2015-021349,2015-12-31,22:09:54,mexicana,L,veggie,20.25
49573,49574,2015-021350,2015-12-31,23:02:05,bbq_ckn,S,chicken,12.75

Create a time series of daily sales

What is most sold product?

In [9]:
main_df['id'].nunique()

21350

In [81]:
main_df.groupby('name').agg(
    sale_count=('id', 'nunique')
).sort_values(by='sale_count', ascending=False).reset_index()

### pivot table

In [19]:
main_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49574 entries, 0 to 49573
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   rownames  49574 non-null  int64
 1   id        49574 non-null  object
 2   date      49574 non-null  datetime64[ns]
 3   time      49574 non-null  object
 4   name      49574 non-null  object
 5   size      49574 non-null  object
 6   type      49574 non-null  object
 7   price     49574 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 3.0+ MB

In [18]:
main_df['date'] = pd.to_datetime(main_df['date'])

### assign & apply

In [22]:
main_df = main_df.assign(
    year_month = lambda x: x.date.dt.to_period('M')
)

# apply ?

# main_df['year_month'] = main_df.apply(lambda x: x.date.dt.to_period('M'), axis=1)

In [36]:
main_df = main_df.rename(
    {
        'name': 'product_name'
    },
    axis=1
)

# main_df.rename(
#     {
#         'name': 'product_name'
#     }, inplace=True
# )

In [37]:
main_df

,rownames,id,date,time,product_name,size,type,price,year_month
0,1,2015-000001,2015-01-01,11:38:36,hawaiian,M,classic,13.25,2015-01
1,2,2015-000002,2015-01-01,11:57:40,classic_dlx,M,classic,16.00,2015-01
2,3,2015-000002,2015-01-01,11:57:40,mexicana,M,veggie,16.00,2015-01
3,4,2015-000002,2015-01-01,11:57:40,thai_ckn,L,chicken,20.75,2015-01
4,5,2015-000002,2015-01-01,11:57:40,five_cheese,L,veggie,18.50,2015-01
...,...,...,...,...,...,...,...,...,...
49569,49570,2015-021348,2015-12-31,21:23:10,four_cheese,L,veggie,17.95,2015-12
49570,49571,2015-021348,2015-12-31,21:23:10,napolitana,S,classic,12.00,2015-12
49571,49572,2015-021348,2015-12-31,21:23:10,ckn_alfredo,M,chicken,16.75,2015-12
49572,49573,2015-021349,2015-12-31,22:09:54,mexicana,L,veggie,20.25,2015-12
49573,49574,2015-021350,2015-12-31,23:02:05,bbq_ckn,S,chicken,12.75,2015-12

In [39]:
# columns: year_month
# rows: name
# value: count unique id

main_df.pivot_table(
    values='id',
    columns='year_month',
    index='product_name',
    aggfunc='nunique'
)

year_month,2015-01,2015-02,2015-03,2015-04,2015-05,2015-06,2015-07,2015-08,2015-09,2015-10,2015-11,2015-12
product_name,,,,,,,,,,,,
bbq_ckn,196,179,220,196,212,181,205,175,184,156,203,166
big_meat,146,144,166,137,176,133,173,149,136,142,164,145
brie_carre,34,44,45,31,44,40,42,43,48,33,42,34
calabrese,66,82,63,82,84,88,81,71,66,80,92,63
cali_ckn,188,191,180,164,187,208,177,215,164,153,187,183
ckn_alfredo,83,73,100,74,84,80,72,80,78,77,91,75
ckn_pesto,75,80,80,83,73,74,85,79,80,68,80,81
classic_dlx,183,168,191,209,203,186,212,197,196,186,210,188
five_cheese,134,112,121,104,118,117,134,112,111,106,101,89
four_cheese,152,147,161,154,173,143,154,132,144,156,142,151
green_garden,73,86,87,81,90,85,96,79,90,82,63,64
hawaiian,174,189,203,208,187,176,183,194,186,180,205,195
ital_cpcllo,120,116,115,122,111,125,126,114,106,102,109,114
ital_supr,160,138,143,159,163,162,141,157,132,134,164,138
ital_veggie,97,83,86,83,85,71,70,77,66,82,72,80
mediterraneo,64,64,77,77,90,73,87,75,73,64,84,84
mexicana,128,103,125,127,102,116,140,119,102,109,148,107
napolitana,131,113,104,118,112,135,120,136,118,125,111,98
pep_msh_pep,100,105,114,107,115,121,120,131,115,102,88,98
pepperoni,225,193,178,157,225,155,219,202,183,185,185,171
peppr_salami,126,105,118,125,111,118,120,99,97,122,125,117
prsc_argla,131,116,122,105,110,103,129,116,107,132,117,110
sicilian,179,147,145,146,145,153,142,152,139,156,166,150
soppressata,79,74,76,94,83,84,82,78,65,84,72,70
southw_ckn,132,148,170,167,151,139,164,160,153,153,159,129
spicy_ital,142,139,167,143,176,155,181,150,126,142,159,142
spin_pesto,74,73,88,60,92,87,74,83,87,60,93,74
spinach_fet,119,105,130,115,134,114,125,137,107,88,117,111
spinach_supr,85,77,69,80,82,83,81,82,67,72,69,71
thai_ckn,190,157,200,186,180,177,207,170,190,178,199,191
the_greek,125,101,108,136,119,112,115,104,101,102,131,107
veggie_veg,142,135,131,132,108,117,129,115,106,94,118,136

### Merge

In [41]:
orders = pd.read_csv('orders.csv')
order_items = pd.read_csv('order_items.csv')
customers = pd.read_csv('customers.csv')

In [43]:
customer_order = customers.merge(orders, on='customer_id', how='inner') # left_on, right_on

In [52]:
merged_df = customer_order.merge(order_items, on='order_id')

In [50]:
merged_df[merged_df['name'] == 'ali']['quantity'].sum()

np.int64(23)

In [51]:
merged_df

,customer_id,name,city,signup_date,order_id,order_date,order_total,item_id,product,quantity,unit_price
0,C001,Customer 1,Frankfurt,2023-03-13,O0017,2024-10-07,147.22,I00053,Widget,7,22.40
1,C002,Customer 2,Cologne,2023-02-12,O0007,2024-03-18,37.66,I00021,Thingamajig,9,86.53
2,C002,Customer 2,Cologne,2023-02-12,O0007,2024-03-18,37.66,I00022,Widget,6,84.32
3,C002,Customer 2,Cologne,2023-02-12,O0007,2024-03-18,37.66,I00023,Gadget,1,66.96
4,C002,Customer 2,Cologne,2023-02-12,O0007,2024-03-18,37.66,I00024,Doohickey,2,30.52
...,...,...,...,...,...,...,...,...,...,...,...
61,C009,Customer 9,Berlin,2023-06-04,O0019,2024-06-02,383.68,I00062,Thingamajig,3,25.28
62,C010,Customer 10,Hamburg,2023-01-11,O0002,2024-10-10,309.58,I00003,Gadget,9,10.83
63,C010,Customer 10,Hamburg,2023-01-11,O0002,2024-10-10,309.58,I00004,Gadget,9,65.44
64,C010,Customer 10,Hamburg,2023-01-11,O0002,2024-10-10,309.58,I00005,Gadget,3,89.16
65,C010,Customer 10,Hamburg,2023-01-11,O0002,2024-10-10,309.58,I00006,Thingamajig,3,72.54

In [59]:
df_list = pd.DataFrame({
    'name': ['John', 'Jane'],
    'hobbies': [['reading', 'music', 'x'], ['sports', 'painting']]
})
df_list

   name              hobbies
0  John  [reading, music, x]
1  Jane   [sports, painting]

In [60]:
df_list.explode('hobbies')

   name   hobbies
0  John   reading
0  John     music
0  John         x
1  Jane    sports
1  Jane  painting

### Missing Value

In [61]:
np.nan

nan

In [63]:
df_missing = pd.DataFrame({
    'A': [1, np.nan, np.nan, 4, 5],
    'B': [6, np.nan, 8, 9, 10],
    'C': [4, np.nan, 4, 6, np.nan]
})
df_missing

     A     B    C
0  1.0   6.0  4.0
1  NaN   NaN  NaN
2  NaN   8.0  4.0
3  4.0   9.0  6.0
4  5.0  10.0  NaN

In [65]:
df_missing.isna()
df_missing.notna()

       A      B      C
0   True   True   True
1  False  False  False
2  False   True   True
3   True   True   True
4   True   True  False

In [66]:
df_missing.fillna(0)

     A     B    C
0  1.0   6.0  4.0
1  0.0   0.0  0.0
2  0.0   8.0  4.0
3  4.0   9.0  6.0
4  5.0  10.0  0.0

In [67]:
df_missing.bfill() # back fill

     A     B    C
0  1.0   6.0  4.0
1  4.0   8.0  4.0
2  4.0   8.0  4.0
3  4.0   9.0  6.0
4  5.0  10.0  NaN

In [68]:
df_missing.ffill() # forward fill

     A     B    C
0  1.0   6.0  4.0
1  1.0   6.0  4.0
2  1.0   8.0  4.0
3  4.0   9.0  6.0
4  5.0  10.0  6.0

In [71]:
df_missing

     A     B    C
0  1.0   6.0  4.0
1  NaN   NaN  NaN
2  NaN   8.0  4.0
3  4.0   9.0  6.0
4  5.0  10.0  NaN

In [70]:
df_missing.interpolate(method='linear')

     A     B    C
0  1.0   6.0  4.0
1  2.0   7.0  4.0
2  3.0   8.0  4.0
3  4.0   9.0  6.0
4  5.0  10.0  6.0

In [72]:
df_missing.dropna()

     A    B    C
0  1.0  6.0  4.0
3  4.0  9.0  6.0

In [77]:
df_missing.dropna(how='all')

     A     B    C
0  1.0   6.0  4.0
2  NaN   8.0  4.0
3  4.0   9.0  6.0
4  5.0  10.0  NaN

In [74]:
df_missing.dropna(subset='C')

     A    B    C
0  1.0  6.0  4.0
2  NaN  8.0  4.0
3  4.0  9.0  6.0

### Sorting & Rank

In [83]:
main_df = pd.read_csv(datasets.iloc[1046]["CSV"])
df = main_df.groupby('name').agg(
    sale_count=('id', 'nunique')
).reset_index()

In [86]:
df_sorted_by_value = df.sort_values(
    by='sale_count',
    ascending=False
)
df_sorted_by_value

            name  sale_count
7    classic_dlx        2329
11      hawaiian        2280
19     pepperoni        2278
0        bbq_ckn        2273
29      thai_ckn        2225
4       cali_ckn        2197
24    southw_ckn        1825
25    spicy_ital        1822
22      sicilian        1820
1       big_meat        1811
9    four_cheese        1809
13     ital_supr        1791
31    veggie_veg        1463
16      mexicana        1426
17    napolitana        1421
27   spinach_fet        1402
21    prsc_argla        1398
20  peppr_salami        1383
12   ital_cpcllo        1380
30     the_greek        1361
8    five_cheese        1359
18   pep_msh_pep        1316
10  green_garden         976
5    ckn_alfredo         967
14   ital_veggie         952
26    spin_pesto         945
23   soppressata         941
6      ckn_pesto         938
3      calabrese         918
28  spinach_supr         918
15  mediterraneo         912
2     brie_carre         480

In [ ]:
df_sorted_by_value.sort_index() # sort by index

In [90]:
df['sale_rank'] = df['sale_count'].rank(ascending=False)

In [91]:
df

            name  sale_count  sale_rank
0        bbq_ckn        2273        4.0
1       big_meat        1811       10.0
2     brie_carre         480       32.0
3      calabrese         918       29.5
4       cali_ckn        2197        6.0
5    ckn_alfredo         967       24.0
6      ckn_pesto         938       28.0
7    classic_dlx        2329        1.0
8    five_cheese        1359       21.0
9    four_cheese        1809       11.0
10  green_garden         976       23.0
11      hawaiian        2280        2.0
12   ital_cpcllo        1380       19.0
13     ital_supr        1791       12.0
14   ital_veggie         952       25.0
15  mediterraneo         912       31.0
16      mexicana        1426       14.0
17    napolitana        1421       15.0
18   pep_msh_pep        1316       22.0
19     pepperoni        2278        3.0
20  peppr_salami        1383       18.0
21    prsc_argla        1398       17.0
22      sicilian        1820        9.0
23   soppressata         941       27.0
24    southw_ckn        1825        7.0
25    spicy_ital        1822        8.0
26    spin_pesto         945       26.0
27   spinach_fet        1402       16.0
28  spinach_supr         918       29.5
29      thai_ckn        2225        5.0
30     the_greek        1361       20.0
31    veggie_veg        1463       13.0

In [96]:
df.nlargest(3, columns='sale_count')
df.nsmallest(3, columns='sale_count')

            name  sale_count  sale_rank
2     brie_carre         480       32.0
15  mediterraneo         912       31.0
3      calabrese         918       29.5

### type convert

In [106]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66 entries, 0 to 65
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  66 non-null     object
 1   name         66 non-null     object
 2   city         66 non-null     object
 3   signup_date  66 non-null     datetime64[ns]
 4   order_id     66 non-null     object
 5   order_date   66 non-null     datetime64[ns]
 6   order_total  66 non-null     float64
 7   item_id      66 non-null     object
 8   product      66 non-null     object
 9   quantity     66 non-null     int64
 10  unit_price   66 non-null     float64
dtypes: datetime64[ns](2), float64(2), int64(1), object(6)
memory usage: 5.8+ KB

In [102]:
merged_df['signup_date'] = pd.to_datetime(merged_df['signup_date'])
merged_df['order_date'] = pd.to_datetime(merged_df['order_date'])

In [104]:
merged_df['quantity'] = pd.to_numeric(merged_df['quantity'])

In [107]:
pd.to_timedelta(['1 Day'])

TimedeltaIndex(['1 days'], dtype='timedelta64[ns]', freq=None)

### expanding & rolling

In [110]:
inx = pd.date_range(start='2025-04-01', periods=48, freq='h')

In [117]:
df = pd.DataFrame(
    {
        'sale_count': np.random.randint(10, 90, (48))
    },
    index=inx
)

In [131]:
# cumulative sum
df.expanding(min_periods=5).sum()

                     sale_count
2025-04-01 00:00:00         NaN
2025-04-01 01:00:00         NaN
2025-04-01 02:00:00         NaN
2025-04-01 03:00:00         NaN
2025-04-01 04:00:00       250.0
2025-04-01 05:00:00       288.0
2025-04-01 06:00:00       367.0
2025-04-01 07:00:00       413.0
2025-04-01 08:00:00       446.0
2025-04-01 09:00:00       494.0
2025-04-01 10:00:00       546.0
2025-04-01 11:00:00       587.0
2025-04-01 12:00:00       602.0
2025-04-01 13:00:00       691.0
2025-04-01 14:00:00       765.0
2025-04-01 15:00:00       797.0
2025-04-01 16:00:00       808.0
2025-04-01 17:00:00       890.0
2025-04-01 18:00:00       947.0
2025-04-01 19:00:00       972.0
2025-04-01 20:00:00       986.0
2025-04-01 21:00:00      1024.0
2025-04-01 22:00:00      1041.0
2025-04-01 23:00:00      1100.0
2025-04-02 00:00:00      1153.0
2025-04-02 01:00:00      1236.0
2025-04-02 02:00:00      1260.0
2025-04-02 03:00:00      1307.0
2025-04-02 04:00:00      1352.0
2025-04-02 05:00:00      1362.0
2025-04-02 06:00:00      1386.0
2025-04-02 07:00:00      1472.0
2025-04-02 08:00:00      1483.0
2025-04-02 09:00:00      1521.0
2025-04-02 10:00:00      1569.0
2025-04-02 11:00:00      1650.0
2025-04-02 12:00:00      1734.0
2025-04-02 13:00:00      1765.0
2025-04-02 14:00:00      1788.0
2025-04-02 15:00:00      1801.0
2025-04-02 16:00:00      1877.0
2025-04-02 17:00:00      1917.0
2025-04-02 18:00:00      1962.0
2025-04-02 19:00:00      1988.0
2025-04-02 20:00:00      2051.0
2025-04-02 21:00:00      2074.0
2025-04-02 22:00:00      2098.0
2025-04-02 23:00:00      2123.0

In [137]:
df.rolling(window=2).sum()

                     sale_count
2025-04-01 00:00:00         NaN
2025-04-01 01:00:00        66.0
2025-04-01 02:00:00        84.0
2025-04-01 03:00:00        84.0
2025-04-01 04:00:00        45.0
2025-04-01 05:00:00        45.0
2025-04-01 06:00:00        79.0
2025-04-01 07:00:00        79.0
2025-04-01 08:00:00        46.0
2025-04-01 09:00:00        48.0
2025-04-01 10:00:00        52.0
2025-04-01 11:00:00        52.0
2025-04-01 12:00:00        41.0
2025-04-01 13:00:00        89.0
2025-04-01 14:00:00        89.0
2025-04-01 15:00:00        74.0
2025-04-01 16:00:00        32.0
2025-04-01 17:00:00        82.0
2025-04-01 18:00:00        82.0
2025-04-01 19:00:00        57.0
2025-04-01 20:00:00        25.0
2025-04-01 21:00:00        38.0
2025-04-01 22:00:00        38.0
2025-04-01 23:00:00        59.0
2025-04-02 00:00:00        59.0
2025-04-02 01:00:00        83.0
2025-04-02 02:00:00        83.0
2025-04-02 03:00:00        47.0
2025-04-02 04:00:00        47.0
2025-04-02 05:00:00        45.0
2025-04-02 06:00:00        24.0
2025-04-02 07:00:00        86.0
2025-04-02 08:00:00        86.0
2025-04-02 09:00:00        38.0
2025-04-02 10:00:00        48.0
2025-04-02 11:00:00        81.0
2025-04-02 12:00:00        84.0
2025-04-02 13:00:00        84.0
2025-04-02 14:00:00        31.0
2025-04-02 15:00:00        23.0
2025-04-02 16:00:00        76.0
2025-04-02 17:00:00        76.0
2025-04-02 18:00:00        45.0
2025-04-02 19:00:00        45.0
2025-04-02 20:00:00        63.0
2025-04-02 21:00:00        63.0
2025-04-02 22:00:00        24.0
2025-04-02 23:00:00        25.0

In [130]:
df.resample('1D').agg({
    'sale_count': 'sum'
})

            sale_count
2025-04-01        1100
2025-04-02        1023